export const dummy = {
  data: {
    userInfo: {
      id: 1,
      userId: "one",
      userNickName: "yoon",
      nowGoal: null,
      latestPostId: 4,
      authorization: false,
      createdAt: "2022-04-13T05:20:14.000Z",
      updatedAt: "2022-04-14T06:18:03.000Z",
      iat: 1649917138,
      exp: 1650003538,
    },
    latest: {
      id: 4,
      goal: "null",
      user_id: 1,
      img: {
        type: "Buffer",
        data: [
          47, 105, 109, 97, 103, 101, 47, 50, 97, 52, 101, 98, 51, 53, 98, 52,
          57, 102, 57, 102, 51, 50, 100, 97, 98, 52, 98, 100, 57, 49, 48, 49,
          102, 54, 101, 101, 101, 54, 97,
        ],
      },
      info: "제임스 하든",
    },
    friends: [],
    friendslatest: [],
  },
  message: "ok",
};

const mypost = {
  data: {
    posts: [
      {
        id: 4,
        goal: "null",
        photo: {
          type: "Buffer",
          data: [
            47, 105, 109, 97, 103, 101, 47, 50, 97, 52, 101, 98, 51, 53, 98, 52,
            57, 102, 57, 102, 51, 50, 100, 97, 98, 52, 98, 100, 57, 49, 48, 49,
            102, 54, 101, 101, 101, 54, 97,
          ],
        },
        content: "제임스 하든",
        user_id: 1,
        createdAt: "2022-04-14T06:18:03.000Z",
        updatedAt: "2022-04-14T06:18:03.000Z",
      },
      {
        id: 3,
        goal: "null",
        photo: {
          type: "Buffer",
          data: [
            47, 105, 109, 97, 103, 101, 47, 101, 48, 53, 56, 56, 99, 102, 102,
            53, 101, 51, 100, 97, 51, 100, 53, 51, 48, 55, 99, 53, 51, 51, 100,
            56, 100, 48, 49, 55, 50, 52, 100,
          ],
        },
        content: "제임스 하든",
        user_id: 1,
        createdAt: "2022-04-14T06:15:22.000Z",
        updatedAt: "2022-04-14T06:15:22.000Z",
      },
      {
        id: 2,
        goal: "1주일에 3kg감량",
        photo: {
          type: "Buffer",
          data: [
            47, 105, 109, 97, 103, 101, 47, 98, 101, 57, 48, 54, 56, 101, 49,
            56, 100, 55, 102, 100, 50, 97, 48, 52, 56, 49, 100, 48, 55, 56, 100,
            48, 54, 57, 102, 50, 57, 102, 56,
          ],
        },
        content: "test2",
        user_id: 1,
        createdAt: "2022-04-13T05:37:52.000Z",
        updatedAt: "2022-04-13T05:37:52.000Z",
      },
      {
        id: 1,
        goal: "1주일에 3kg감량",
        photo: {
          type: "Buffer",
          data: [
            47, 105, 109, 97, 103, 101, 47, 98, 50, 57, 100, 101, 48, 97, 49,
            102, 55, 56, 50, 51, 52, 48, 54, 53, 101, 97, 98, 48, 100, 97, 48,
            101, 57, 50, 101, 56, 102, 48, 56,
          ],
        },
        content: "asdfsd",
        user_id: 1,
        createdAt: "2022-04-13T05:34:11.000Z",
        updatedAt: "2022-04-13T05:34:11.000Z",
      },
    ],
    hasNext: false,
  },
  message: "ok",
};
